<?php
$fruits = ["apple" =>"といったらりんご", "orange" => "といったらみかん", "peach" => "といったらもも"];

foreach ($fruits as $key => $value) {
    echo $key;
    echo $value;
    echo '<br>';

}

?>

<?php
echo "1. トランザクション"."<br>";
echo "取引記録などの意味の他に、ソフトウェアの処理方式の一つで、互いに関連・依存する複数の処理をまとめ、一体不可分の処理単位として扱うことを指す場合が多い。"."<br>";
echo "2. 排他ロック"."<br>";
echo "データベースシステムなどで記憶領域への同時アクセスを制限するロック機構の一つで、他の実行主体によるアクセスを完全に禁止するもの。"."<br>";
echo "3. チューニング"."<br>";
echo "情報システムやコンピュータ、ソフトウェアなどの設定や構成を調整し、目標の状態に近づけたり、性能を最大限引き出したりする作業"."<br>";
?>